src/main/java/ok/dht/test/ushkov/report/stage6/profiles/2022-11-15-23-58-48_range1000_get_range_t4_c64_R50000_d1m/wrk2.txt
Running 1m test @ http://localhost:1337
  4 threads and 64 connections
  Thread calibration: mean lat.: 5225.056ms, rate sampling interval: 17825ms
  Thread calibration: mean lat.: 5145.883ms, rate sampling interval: 17989ms
  Thread calibration: mean lat.: 5530.069ms, rate sampling interval: 18055ms
  Thread calibration: mean lat.: 5311.847ms, rate sampling interval: 18530ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.07s    13.92s    1.00m    58.99%
    Req/Sec     8.00      0.00     8.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.88s 
 75.000%   45.81s 
 90.000%    0.88m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10051.583     0.000000            1         1.00
   14991.359     0.100000          167         1.11
   19873.791     0.200000          334         1.25
   24543.231     0.300000          499         1.43
   29310.975     0.400000          666         1.67
   33882.111     0.500000          832         2.00
   36143.103     0.550000          915         2.22
   38633.471     0.600000          999         2.50
   40992.767     0.650000         1081         2.86
   43384.831     0.700000         1166         3.33
   45842.431     0.750000         1248         4.00
   47022.079     0.775000         1289         4.44
   48168.959     0.800000         1331         5.00
   49414.143     0.825000         1372         5.71
   50561.023     0.850000         1414         6.67
   51904.511     0.875000         1456         8.00
   52428.799     0.887500         1476         8.89
   53084.159     0.900000         1497        10.00
   54034.431     0.912500         1518        11.43
   54951.935     0.925000         1539        13.33
   55836.671     0.937500         1561        16.00
   56262.655     0.943750         1570        17.78
   56623.103     0.950000         1580        20.00
   57147.391     0.956250         1591        22.86
   57540.607     0.962500         1601        26.67
   57966.591     0.968750         1612        32.00
   58163.199     0.971875         1618        35.56
   58392.575     0.975000         1623        40.00
   58621.951     0.978125         1627        45.71
   58851.327     0.981250         1633        53.33
   59047.935     0.984375         1639        64.00
   59080.703     0.985938         1640        71.11
   59179.007     0.987500         1643        80.00
   59244.543     0.989062         1645        91.43
   59375.615     0.990625         1648       106.67
   59473.919     0.992188         1651       128.00
   59506.687     0.992969         1652       142.22
   59572.223     0.993750         1654       160.00
   59572.223     0.994531         1654       182.86
   59670.527     0.995313         1657       213.33
   59670.527     0.996094         1657       256.00
   59703.295     0.996484         1658       284.44
   59703.295     0.996875         1658       320.00
   59768.831     0.997266         1660       365.71
   59768.831     0.997656         1660       426.67
   59768.831     0.998047         1660       512.00
   59834.367     0.998242         1661       568.89
   59834.367     0.998437         1661       640.00
   59834.367     0.998633         1661       731.43
   59867.135     0.998828         1662       853.33
   59867.135     0.999023         1662      1024.00
   59867.135     0.999121         1662      1137.78
   59867.135     0.999219         1662      1280.00
   59867.135     0.999316         1662      1462.86
   59899.903     0.999414         1663      1706.67
   59899.903     1.000000         1663          inf
#[Mean    =    34073.841, StdDeviation   =    13916.323]
#[Max     =    59867.136, Total count    =         1663]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1970 requests in 1.00m, 99.80GB read
  Socket errors: connect 0, read 57, write 0, timeout 46
Requests/sec:     32.79
Transfer/sec:      1.66GB